
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ТекстТеста") И Не ПустаяСтрока(Параметры.ТекстТеста) Тогда
		// BSLLS:ExecuteExternalCode-off
		Выполнить(Параметры.ТекстТеста);
		// BSLLS:ExecuteExternalCode-on
	КонецЕсли;

КонецПроцедуры

// BSLLS:ServerSideExportFormMethod-off
&НаСервере
Функция ПолучитьДействиеЭлементаФормы(ИмяЭлемента, Обработчик) Экспорт

	Возврат Элементы[ИмяЭлемента].ПолучитьДействие(Обработчик);

КонецФункции
// BSLLS:ServerSideExportFormMethod-on

// Возвращает описание типа реквизита формы по его имени
//
// Параметры:
//    ИмяРеквизита - Строка - имя реквизита формы
//
// Возвращаемое значение:
//    ОписаниеТипов, Неопределено - описание типа реквизита или Неопределено, если реквизит не найден
//
// BSLLS:ServerSideExportFormMethod-off
&НаСервере
Функция ТипРеквизитаФормы(ИмяРеквизита) Экспорт

	Для Каждого ОписаниеРеквизита Из ПолучитьРеквизиты() Цикл
		Если ОписаниеРеквизита.Имя = ИмяРеквизита Тогда
			Возврат ОписаниеРеквизита.Тип;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции
// BSLLS:ServerSideExportFormMethod-on
