
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ТекстТеста") И Не ПустаяСтрока(Параметры.ТекстТеста) Тогда
		// BSLLS:ExecuteExternalCode-off
		Выполнить(Параметры.ТекстТеста);
		// BSLLS:ExecuteExternalCode-on
	КонецЕсли;

КонецПроцедуры

// BSLLS:ServerSideExportFormMethod-off
&НаСервере
Функция ПолучитьДействиеЭлементаФормы(ИмяЭлемента, Обработчик) Экспорт

	Возврат Элементы[ИмяЭлемента].ПолучитьДействие(Обработчик);

КонецФункции
// BSLLS:ServerSideExportFormMethod-on

// Возвращает значение свойства элемента формы на сервере
//
// Параметры:
//    ИмяЭлемента - Строка - имя элемента формы
//    ИмяСвойства - Строка - имя свойства, значение которого нужно получить
//
// Возвращаемое значение:
//    Произвольный, Неопределено - значение свойства или Неопределено, если элемент не найден
//
// BSLLS:ServerSideExportFormMethod-off
&НаСервере
Функция ПолучитьСвойствоЭлементаФормы(ИмяЭлемента, ИмяСвойства) Экспорт

	ЭлементФормы = Элементы.Найти(ИмяЭлемента);

	Если ЭлементФормы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ЭлементФормы[ИмяСвойства];

КонецФункции
// BSLLS:ServerSideExportFormMethod-on

// Возвращает значение свойства команды формы на сервере
//
// Параметры:
//    ИмяКоманды  - Строка - имя команды формы
//    ИмяСвойства - Строка - имя свойства, значение которого нужно получить
//
// Возвращаемое значение:
//    Произвольный, Неопределено - значение свойства или Неопределено, если команда не найдена
//
// BSLLS:ServerSideExportFormMethod-off
&НаСервере
Функция ПолучитьСвойствоКомандыФормы(ИмяКоманды, ИмяСвойства) Экспорт

	КомандаФормы = Команды.Найти(ИмяКоманды);

	Если КомандаФормы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат КомандаФормы[ИмяСвойства];

КонецФункции
// BSLLS:ServerSideExportFormMethod-on

// Возвращает описание типа реквизита формы по его имени
//
// Параметры:
//    ИмяРеквизита - Строка - имя реквизита формы
//
// Возвращаемое значение:
//    ОписаниеТипов, Неопределено - описание типа реквизита или Неопределено, если реквизит не найден
//
// BSLLS:ServerSideExportFormMethod-off
&НаСервере
Функция ТипРеквизитаФормы(ИмяРеквизита) Экспорт

	Для Каждого ОписаниеРеквизита Из ПолучитьРеквизиты() Цикл
		Если ОписаниеРеквизита.Имя = ИмяРеквизита Тогда
			Возврат ОписаниеРеквизита.ТипЗначения;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции
// BSLLS:ServerSideExportFormMethod-on
