
#Область  СлужебныйПрограммныйИнтерфейс

#Область ОбъявлениеТестов

Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ДобавитьТестовыйНабор("formhelper: ПолеВвода (строка)")
			.ДобавитьТест("ПолеВводаСтрока_Успешный")
			.ДобавитьТест("ПолеВводаСтрока_НовыйПереместить_Успешный")
			.ДобавитьТест("ПолеВводаСтрока_СуществующийПереместить_Успешный")
			.ДобавитьТест("ПолеВводаСтрока_СуществующийПереместить_ВКонецГруппы_Успешный")
			.ДобавитьТест("ПолеВводаСтрока_НовыйОбработчик_Успешный")
			.ДобавитьТест("ПолеВводаСтрока_НовыйОбработчикНеЗаданВидЭлмента_Негативный")
			.ДобавитьТест("ПолеВводаСтрока_НовыйОбработчикНекорректныйМетод_Негативный")
			.ДобавитьТест("ПолеВводаСтрока_НовыйОбработчикНекорректноеИмяФункции_Негативный")
			.ДобавитьТест("ПолеВводаСтрока_СуществующийОбработчик_Успешный")
			.ДобавитьТест("ПолеВводаСтрока_ОбработчикОкончаниеВводаТекста_Успешный")
		.ДобавитьТестовыйНабор("formhelper: ПолеВвода (число)")
			.ДобавитьТест("ПолеВводаЧисло_Успешный")
			.ДобавитьТест("ПолеВводаЧисло_НеПолеВвода_Негативный")
		.ДобавитьТестовыйНабор("formhelper: ПолеКартинки")
			.ДобавитьТест("ПолеКартинки_Успешный")
		.ДобавитьТестовыйНабор("formhelper: Декорация")
			.ДобавитьТест("Декорация_Успешный")
		.ДобавитьТестовыйНабор("formhelper: ГруппаФормы")
			.ДобавитьТест("ГруппаФормы_Успешный")
			.ДобавитьТест("ГруппаФормы_ГоризонтальноеПоложениеПодчиненных_Успешный")
		.ДобавитьТестовыйНабор("formhelper: Свойство ""Гиперссылка""")
			.ДобавитьТест("Гиперссылка_Успешный")
			.ДобавитьТест("Гиперссылка_Негативный")
		.ДобавитьТестовыйНабор("formhelper: ТекущаяКоманда")
			.ДобавитьТест("ТекущаяКоманда_Существующая_Успешный")
			.ДобавитьТест("ТекущаяКоманда_Отсутствующая_Негативный")
	;

КонецПроцедуры

#КонецОбласти

#Область События

Процедура ПослеКаждогоТеста() Экспорт

	_Форма = ЮТест.Контекст().Значение("_Форма");
	Если ТипЗнч(_Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
		_Форма.Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Тесты

#Область ПолеВводаСтрока

Процедура ПолеВводаСтрока_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеВвода(""ТестоваяПолеСтрока"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Заголовок(""Тестовое поле (строка)"")
	|		.ПоложениеЗаголовка(ПоложениеЗаголовкаЭлементаФормы.Верх)
	|		.Видимость(Истина)
	|		.Доступность(Истина)
	|		.ТолькоПросмотр(Истина)
	|		.ПропускатьПриВводе(Истина)
	|		.АктивизироватьПоУмолчанию(Истина)
	|		.ВажностьПриОтображении(ВажностьПриОтображении.Высокая)
	|		.ПоведениеПриНедоступностиОсновногоСервера(ПоведениеПриНедоступностиОсновногоСервера.ОтключитьДоступность)
	|		.Маска(""99-99"")
	|		.РежимПароля(Ложь)
	|		.МногострочныйРежим(Истина)
	|		.РасширенноеРедактирование(Истина)
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("ТестоваяПолеСтрока")
		)
	;
	ЮТест.ОжидаетЧто(_Форма.Элементы["ТестоваяПолеСтрока"])
		// ПутьКДанным на клиенте недоступно. Не проверяем
		//.Свойство("ПутьКДанным").Равно("Объект.ТестоваяПолеСтрока")

		.Свойство("Заголовок").Равно("Тестовое поле (строка)")
		.Свойство("Вид").Равно(ВидПоляФормы.ПолеВвода)
		.Свойство("ПоложениеЗаголовка").Равно(ПоложениеЗаголовкаЭлементаФормы.Верх)
		.Свойство("Видимость").Равно(Истина)
		.Свойство("Доступность").Равно(Истина)
		.Свойство("ТолькоПросмотр").Равно(Истина)
		.Свойство("ПропускатьПриВводе").Равно(Истина)
		.Свойство("АктивизироватьПоУмолчанию").Равно(Истина)

		// Поле имеет смысл для мобильного клиента или сервера. На клиенте перечисление недоступно
		//.Свойство("ВажностьПриОтображении").Равно(ВажностьПриОтображении.Высокая)

		// Поле имеет смысл для мобильного клиента или автономного сервера. На клиенте перечисление недоступно
		//.Свойство("ПоведениеПриНедоступностиОсновногоСервера")
		//	.Равно(ПоведениеПриНедоступностиОсновногоСервера.ОтключитьДоступность)

		.Свойство("Маска").Равно("99-99")
		.Свойство("РежимПароля").Равно(Ложь)
		.Свойство("МногострочныйРежим").Равно(Истина)
		.Свойство("РасширенноеРедактирование").Равно(Истина)
	;

КонецПроцедуры

Процедура ПолеВводаСтрока_НовыйПереместить_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	// Добавил группу и два элемента (подготовка)
	|	.ГруппаФормы(""Группа1"")
	|
	|	//
	|	.ПолеВвода(""ПолеВводаПеред"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Родитель(""Группа1"")
	|
	|	//
	|	.ПолеВвода(""ПолеВводаПосле"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Родитель(""Группа1"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;
	|
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	// Добавил ещё один элемент в ранее созданную группу и переместил его перед элементом "ПолеВводаПосле"
	|	.ПолеВвода(""ТестоваяПолеСтрока"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Родитель(""Группа1"")
	|		.Переместить(""ПолеВводаПосле"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("Группа1")
		)
	;
	ЮТест
		.ОжидаетЧто(_Форма.Элементы.Группа1.ПодчиненныеЭлементы[0].Имя)
			.Равно("ПолеВводаПеред");
	ЮТест
		.ОжидаетЧто(_Форма.Элементы.Группа1.ПодчиненныеЭлементы[1].Имя)
			.Равно("ТестоваяПолеСтрока");
	ЮТест
		.ОжидаетЧто(_Форма.Элементы.Группа1.ПодчиненныеЭлементы[2].Имя)
			.Равно("ПолеВводаПосле");

КонецПроцедуры

Процедура ПолеВводаСтрока_СуществующийПереместить_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	// Добавил группу два элемента и один вне группы (подготовка)
	|	.ГруппаФормы(""Группа1"")
	|
	|	//
	|	.ПолеВвода(""ПолеВводаПеред"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Родитель(""Группа1"")
	|
	|	//
	|	.ПолеВвода(""ПолеВводаПосле"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Родитель(""Группа1"")
	|
	|	//
	|	.ПолеВвода(""ТестоваяПолеСтрока"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;
	|
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	// Перемещаю поле "ТестоваяПолеСтрока" в группу последним
	|	.ТекущийЭлемент(""ТестоваяПолеСтрока"")
	|		.Родитель(""Группа1"")
	|		.Переместить()
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("Группа1")
		)
	;
	ЮТест
		.ОжидаетЧто(_Форма.Элементы.Группа1.ПодчиненныеЭлементы[0].Имя)
			.Равно("ПолеВводаПеред");
	ЮТест
		.ОжидаетЧто(_Форма.Элементы.Группа1.ПодчиненныеЭлементы[1].Имя)
			.Равно("ПолеВводаПосле");
	ЮТест
		.ОжидаетЧто(_Форма.Элементы.Группа1.ПодчиненныеЭлементы[2].Имя)
			.Равно("ТестоваяПолеСтрока");

КонецПроцедуры

Процедура ПолеВводаСтрока_СуществующийПереместить_ВКонецГруппы_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	// Добавил группу и три элемента (подготовка)
	|	.ГруппаФормы(""Группа1"")
	|
	|	//
	|	.ПолеВвода(""ПолеВвода1"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Родитель(""Группа1"")
	|
	|	//
	|	.ПолеВвода(""ПолеВвода2"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Родитель(""Группа1"")
	|
	|	//
	|	.ПолеВвода(""ПолеВвода3"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Родитель(""Группа1"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;
	|
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	// Перемещаю поле "ПолеВвода1" в конец группы
	|	.ТекущийЭлемент(""ПолеВвода1"")
	|		.Переместить()
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("Группа1")
		)
	;
	ЮТест
		.ОжидаетЧто(_Форма.Элементы.Группа1.ПодчиненныеЭлементы[0].Имя)
			.Равно("ПолеВвода2");
	ЮТест
		.ОжидаетЧто(_Форма.Элементы.Группа1.ПодчиненныеЭлементы[1].Имя)
			.Равно("ПолеВвода3");
	ЮТест
		.ОжидаетЧто(_Форма.Элементы.Группа1.ПодчиненныеЭлементы[2].Имя)
			.Равно("ПолеВвода1");

КонецПроцедуры

Процедура ПолеВводаСтрока_НовыйОбработчик_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеВвода(""ТестоваяПолеСтрока"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Обработчик(""ПриИзменении"", ""ТестоваяПолеСтрокаПриИзменении"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("ТестоваяПолеСтрока")
		)
	;

	Обработчик = _Форма.ПолучитьДействиеЭлементаФормы("ТестоваяПолеСтрока", "ПриИзменении");
	ЮТест.ОжидаетЧто(Обработчик)
		.Равно("ТестоваяПолеСтрокаПриИзменении")
	;

КонецПроцедуры

Процедура ПолеВводаСтрока_НовыйОбработчикНеЗаданВидЭлмента_Негативный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ДобавитьЭлементФормы(""ТестоваяПолеСтрока"")
	|		.Обработчик(""ПриИзменении"", ""ТестоваяПолеСтрокаПриИзменении"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	ТекстИсключения = "";

	Попытка
		ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
			СтруктураПараметров);
	Исключение
		ТекстИсключения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	// Проверки
	ЮТест.ОжидаетЧто(ТекстИсключения)
		.Равно("Обработчик: не задан вид элемента")
	;

КонецПроцедуры

Процедура ПолеВводаСтрока_НовыйОбработчикНекорректныйМетод_Негативный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеВвода(""ТестоваяПолеСтрока"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Обработчик(""ПриИзменении1"", ""ТестоваяПолеСтрокаПриИзменении"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	ТекстИсключения = "";

	Попытка
		ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
			СтруктураПараметров);
	Исключение
		ТекстИсключения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	// Проверки
	ЮТест.ОжидаетЧто(ТекстИсключения)
		.Равно("Обработчик: имя обработчика не соответвует виду элемента формы")
	;

КонецПроцедуры

Процедура ПолеВводаСтрока_НовыйОбработчикНекорректноеИмяФункции_Негативный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеВвода(""ТестоваяПолеСтрока"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Обработчик(""ПриИзменении"", ""@#%@%"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	ТекстИсключения = "";

	Попытка
		ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
			СтруктураПараметров);
	Исключение
		ТекстИсключения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	// Проверки
	ЮТест.ОжидаетЧто(ТекстИсключения)
		.Равно("Обработчик: передан параметр ""Метод"" некорректного формата - ""@#%@%""")
	;

КонецПроцедуры

Процедура ПолеВводаСтрока_СуществующийОбработчик_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеВвода(""ТестоваяПолеСтрока"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;
	|
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	// Задаю обработчик для поля "ТестоваяПолеСтрока"
	|	.ТекущийЭлемент(""ТестоваяПолеСтрока"")
	|		.Обработчик(""ПриИзменении"", ""ТестоваяПолеСтрокаПриИзменении"")
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("ТестоваяПолеСтрока")
		)
	;

	Обработчик = _Форма.ПолучитьДействиеЭлементаФормы("ТестоваяПолеСтрока", "ПриИзменении");
	ЮТест.ОжидаетЧто(Обработчик)
		.Равно("ТестоваяПолеСтрокаПриИзменении")
	;

КонецПроцедуры

Процедура ПолеВводаСтрока_ОбработчикОкончаниеВводаТекста_Успешный() Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	.ПолеВвода(""ТестоваяПолеСтрока"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Обработчик(""ОкончаниеВводаТекста"", ""ТестоваяПолеСтрокаОкончаниеВводаТекста"")
	|	.Применить()
	|;");

	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	Обработчик = _Форма.ПолучитьДействиеЭлементаФормы(
		"ТестоваяПолеСтрока", "ОкончаниеВводаТекста");
	ЮТест.ОжидаетЧто(Обработчик)
		.Равно("ТестоваяПолеСтрокаОкончаниеВводаТекста")
	;

КонецПроцедуры

#КонецОбласти

#Область ПолеВводаЧисло

Процедура ПолеВводаЧисло_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеВвода(""ТестоваяПолеЧисло"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеЧисло"")
	|		.ВыделятьОтрицательные(Истина)
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("ТестоваяПолеЧисло")
		)
	;
	ЮТест.ОжидаетЧто(_Форма.Элементы["ТестоваяПолеЧисло"])
		// ПутьКДанным на клиенте недоступно. Не проверяем
		//.Свойство("ПутьКДанным").Равно("Объект.ТестоваяПолеЧисло")

		.Свойство("ВыделятьОтрицательные").Равно(Истина)
	;

КонецПроцедуры

Процедура ПолеВводаЧисло_НеПолеВвода_Негативный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеФлажка(""ТестоваяПолеЧисло"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеЧисло"")
	|		.ВыделятьОтрицательные(Истина)
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	ТекстИсключения = "";

	Попытка
		ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
			СтруктураПараметров);
	Исключение
		ТекстИсключения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	// Проверки
	ЮТест.ОжидаетЧто(ТекстИсключения)
		.Равно("ВыделятьОтрицательные ТестоваяПолеЧисло: установка свойства ""ВыделятьОтрицательные"" доступно только для поля ввода формы")
	;

КонецПроцедуры

#КонецОбласти

Процедура ПолеКартинки_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеКартинки(""ТестовоеПолеКартинки"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.ПоложениеЗаголовка(ПоложениеЗаголовкаЭлементаФормы.Нет)
	|		.РазмерКартинки(РазмерКартинки.АвтоРазмер)
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("ТестовоеПолеКартинки")
		)
	;
	ЮТест.ОжидаетЧто(_Форма.Элементы["ТестовоеПолеКартинки"])
		// ПутьКДанным на клиенте недоступно. Не проверяем
		//.Свойство("ПутьКДанным").Равно("Объект.ТестоваяПолеСтрока")

		.Свойство("ПоложениеЗаголовка").Равно(ПоложениеЗаголовкаЭлементаФормы.Нет)
		.Свойство("РазмерКартинки").Равно(РазмерКартинки.АвтоРазмер)
	;

КонецПроцедуры

Процедура Декорация_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	// TODO:

КонецПроцедуры

Процедура ИзменяетСохраняемыеДанные_БезТекущегоПотока_Негативный() Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	.ИзменяетСохраняемыеДанные(Истина)
	|	.Применить()
	|;");

	ТекстИсключения = "";

	Попытка
		ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
			СтруктураПараметров);
	Исключение
		ТекстИсключения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	ЮТест.ОжидаетЧто(ТекстИсключения)
		.Равно("ИзменяетСохраняемыеДанные: установка свойства ""ИзменяетСохраняемыеДанные""
		|доступно только для команд")
	;

КонецПроцедуры

#Область ГруппаФормы

Процедура ГруппаФормы_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ГруппаФормы(""ТестоваяГруппа"")
	|		// TODO:
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("ТестоваяГруппа")
		)
	;
	ЮТест.ОжидаетЧто(_Форма.Элементы["ТестоваяГруппа"])
		// TODO:
	;

КонецПроцедуры

Процедура ГруппаФормы_ГоризонтальноеПоложениеПодчиненных_Успешный() Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	.ГруппаФормы(""ТестоваяГруппа"")
	|		.ГоризонтальноеПоложениеПодчиненных(ГоризонтальноеПоложениеЭлемента.Лево)
	|	.Применить()
	|;");

	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	ЮТест.ОжидаетЧто(_Форма.Элементы["ТестоваяГруппа"])
		.Свойство("ГоризонтальноеПоложениеПодчиненных")
			.Равно(ГоризонтальноеПоложениеЭлемента.Лево)
	;

КонецПроцедуры

#КонецОбласти

#Область Гиперссылка

Процедура Гиперссылка_Успешный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеНадписи(""ТестовоеПолеНадписи"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Гиперссылка(Истина)
	|
	|	//
	|	.ПолеКартинки(""ТестовоеПолеКартинки"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Гиперссылка(Истина)
	|
	|	//
	|	.Декорация(""ДекорацияНадпись"", ВидДекорацииФормы.Надпись)
	|		.Гиперссылка(Истина)
	|
	|	//
	|	.Декорация(""ДекорацияКартинка"", ВидДекорацииФормы.Картинка)
	|		.Гиперссылка(Истина)
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя").Равно("ТестовоеПолеНадписи")
		)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя").Равно("ТестовоеПолеКартинки")
		)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя").Равно("ДекорацияНадпись")
		)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя").Равно("ДекорацияКартинка")
		)
	;
	ЮТест.ОжидаетЧто(_Форма.Элементы["ТестовоеПолеНадписи"])
		.Свойство("Гиперссылка").Равно(Истина)
	;
	ЮТест.ОжидаетЧто(_Форма.Элементы["ТестовоеПолеКартинки"])
		.Свойство("Гиперссылка").Равно(Истина)
	;
	ЮТест.ОжидаетЧто(_Форма.Элементы["ДекорацияНадпись"])
		.Свойство("Гиперссылка").Равно(Истина)
	;
	ЮТест.ОжидаетЧто(_Форма.Элементы["ДекорацияКартинка"])
		.Свойство("Гиперссылка").Равно(Истина)
	;

КонецПроцедуры

Процедура Гиперссылка_Негативный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеВвода(""ТестовоеПолеВвода"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Гиперссылка(Истина)
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");

	// Выполнение
	ТекстИсключения = "";

	Попытка
		ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
			СтруктураПараметров);
	Исключение
		ТекстИсключения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	// Проверки
	ЮТест.ОжидаетЧто(ТекстИсключения)
		.Равно("Гиперссылка ТестовоеПолеВвода: установка свойства ""Гиперссылка"" доступно только для поля ввода с видами ""Поле надписи""
		|и ""Поле картинки"" или для декорации любого вида")
	;

КонецПроцедуры


#КонецОбласти

#Область Команда

Процедура ТекущаяКоманда_Существующая_Успешный() Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	.Команда(""ТестоваяКоманда"", ""ТестоваяКомандаНаКлиенте"")
	|		.Заголовок(""Тестовая команда"")
	|	.Применить()
	|;
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	.ТекущаяКоманда(""ТестоваяКоманда"")
	|		.Подсказка(""Подсказка установлена повторно"")
	|	.Применить()
	|;");

	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	ЮТест.ОжидаетЧто(_Форма.Команды.Найти("ТестоваяКоманда"))
		.НеРавно(Неопределено)
	;
	ЮТест.ОжидаетЧто(_Форма.Команды.Найти("ТестоваяКоманда").Подсказка)
		.Равно("Подсказка установлена повторно")
	;

КонецПроцедуры

Процедура ТекущаяКоманда_Отсутствующая_Негативный() Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	.ТекущаяКоманда(""НесуществующаяКоманда"")
	|		.Подсказка(""Подсказка"")
	|	.Применить()
	|;");

	ТекстИсключения = "";

	Попытка
		ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
			СтруктураПараметров);
	Исключение
		ТекстИсключения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	ЮТест.ОжидаетЧто(ТекстИсключения)
		.Равно("Команда не найдена НесуществующаяКоманда")
	;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
